app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"  ORDER BY "teams"."group" ASC, "teams"."point" DESC
---
  def index
    @teams = Team.all.order(group: :asc, point: :desc)